Конфигурация/InformationRegisters/ЖурналПередачиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ЖурналПередачиДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЭкземпляра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭкземпляров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭкземпляра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ИсторияСостоянийДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСостоянийДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ТекущиеСостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСостоянияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассмотрен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ЕжедневныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ЕжедневныйОтчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РабочееВремяПользователей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НекорректнаяДлительность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказанияВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУказанияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
								<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
								<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
								<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
								<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроектнаяЗадача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданаАвтоматически</Name>
							<Comment>Создана автоматически при выполнении задачи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/ДелаХраненияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>ДелаХраненияДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелоЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМестоХранения</Name>
					<Comment>Последняя актуальная версия 1.4.3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТома</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтноситсяКНоменклатуреДел</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураДел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСИнструкциямиПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ ПО РАБОТЕ С ИНСТРУКЦИЯМИ
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает соответствия форм с предметами инструкций
//
Функция СоответствияФормИПредметовИнструкций() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("Справочник.СертификатыЭП.Форма.ВыборСертификатаДляПодписания", Справочники.ПредметыИнструкций.ЭлектроннаяПодпись);
	
	Соответствие.Вставить("Справочник.ВнутренниеДокументы.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.ВнутренниеДокументы);
	Соответствие.Вставить("Справочник.ВходящиеДокументы.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.ВходящиеДокументы);
	Соответствие.Вставить("Справочник.ИсходящиеДокументы.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.ИсходящиеДокументы);
	
	Соответствие.Вставить("Справочник.ДелаХраненияДокументов.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.Дела);
	
	Соответствие.Вставить("Справочник.НоменклатураДел.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.НоменклатураДел);
	
	Соответствие.Вставить("Документ.ЕжедневныйОтчет.Форма.ФормаДокумента", Справочники.ПредметыИнструкций.ЕжедневныйОтчет);
	
	Соответствие.Вставить("РегистрСведений.ЖурналПередачиДокументов.Форма.ФормаЗаписи", Справочники.ПредметыИнструкций.ЖурналПередачи);
	
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессИсполнениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаЗадачиКонтролера", Справочники.ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаКонтролера);
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаЗадачиОтвИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаОтветственногоИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаЗадачиПроверяющего", Справочники.ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаПроверяющего);
	
	Соответствие.Вставить("БизнесПроцесс.КомплексныйПроцесс.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.КомплексныйПроцессКарточка);
	Соответствие.Вставить("БизнесПроцесс.КомплексныйПроцесс.Форма.ФормаЗадачиКонтролера", Справочники.ПредметыИнструкций.ЗадачиКомплексногоПроцессаЗадачаКонтролера);
	
	Соответствие.Вставить("БизнесПроцесс.ОбработкаВнутреннегоДокумента.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессОбработкаВнутреннегоДокументаКарточка);
	
	Соответствие.Вставить("БизнесПроцесс.ОбработкаВходящегоДокумента.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессОбработкаВходящегоДокументаКарточка);
	
	Соответствие.Вставить("БизнесПроцесс.ОбработкаИсходящегоДокумента.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессОбработкаИсходящегоДокументаКарточка);
	
	Соответствие.Вставить("БизнесПроцесс.Ознакомление.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессОзнакомлениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Ознакомление.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаОзнакомлениеЗадачаИсполнителя);
	
	Соответствие.Вставить("БизнесПроцесс.Поручение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессПоручениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Поручение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Поручение.Форма.ФормаЗадачиКонтролера", Справочники.ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаКонтролера);
	Соответствие.Вставить("БизнесПроцесс.Поручение.Форма.ФормаЗадачиПроверяющего", Справочники.ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаПроверяющего);
	
	Соответствие.Вставить("БизнесПроцесс.Приглашение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессПриглашениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Приглашение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Приглашение.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаОзнакомления);
	Соответствие.Вставить("БизнесПроцесс.Приглашение.Форма.ФормаЗадачиОповестить", Справочники.ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаОповещения);
	
	Соответствие.Вставить("БизнесПроцесс.Рассмотрение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессРассмотрениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Рассмотрение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаРассмотрениеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Рассмотрение.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаРассмотрениеЗадачаОзнакомления);
	
	Соответствие.Вставить("БизнесПроцесс.Регистрация.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессРегистрацияКарточка);
	Соответствие.Вставить("БизнесПроцесс.Регистрация.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаРегистрацияЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Регистрация.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаРегистрацияЗадачаОзнакомления);
	
	Соответствие.Вставить("БизнесПроцесс.Согласование.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессСогласованиеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Согласование.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаСогласованиеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Согласование.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаСогласованиеЗадачаОзнакомления);
	
	Соответствие.Вставить("БизнесПроцесс.Утверждение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессУтверждениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Утверждение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаУтверждениеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Утверждение.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаУтверждениеЗадачаОзнакомления);
	
	Возврат Соответствие;
	
КонецФункции

// Формирует массив предметов инструкций с описаниями для указанной формы.
//
Процедура ПредметыИнструкцийСоответствующиеФорме(Предметы, ЭтаФорма) Экспорт
	
	Предметы = Новый Массив;
	
	ИмяФормы = ЭтаФорма.ИмяФормы;
	
	СоответствияФормИПредметов = СоответствияФормИПредметовИнструкций();
	
	Предмет = СоответствияФормИПредметов.Получить(ИмяФормы);
	
	Если Предмет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредметыИнструкций = Справочники.ПредметыИнструкций;
	
	Если Предмет = ПредметыИнструкций.ВнутренниеДокументы
		ИЛИ Предмет = ПредметыИнструкций.ВходящиеДокументы
		ИЛИ Предмет = ПредметыИнструкций.ИсходящиеДокументы Тогда
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(Предмет);
		ЗаполнитьХарактеристикиПредметаПоРеквизитамДокумента(ОписаниеПредмета, ЭтаФорма.Объект);
		Предметы.Добавить(ОписаниеПредмета);
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(ПредметыИнструкций.Документы);
		Предметы.Добавить(ОписаниеПредмета);
		
	ИначеЕсли Предмет = ПредметыИнструкций.ПроцессИсполнениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.КомплексныйПроцессКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессОбработкаВнутреннегоДокументаКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессОбработкаВходящегоДокументаКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессОбработкаИсходящегоДокументаКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессОзнакомлениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессПоручениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессПриглашениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессРассмотрениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессРегистрацияКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессСогласованиеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессУтверждениеКарточка Тогда
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(Предмет);
		ЗаполнитьХарактеристикиПредметаПоРеквизитамПроцесса(ОписаниеПредмета, ЭтаФорма.Объект, ЭтаФорма);
		Предметы.Добавить(ОписаниеПредмета);
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(ПредметыИнструкций.Процессы);
		Предметы.Добавить(ОписаниеПредмета);
		
	ИначеЕсли Предмет = ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаКонтролера
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаОтветственногоИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаПроверяющего
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиКомплексногоПроцессаЗадачаКонтролера
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаОзнакомлениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаКонтролера
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаПроверяющего
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаОзнакомления
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаОповещения
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаРассмотрениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаРассмотрениеЗадачаОзнакомления
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаРегистрацияЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаРегистрацияЗадачаОзнакомления
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаСогласованиеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаСогласованиеЗадачаОзнакомления
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаУтверждениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаУтверждениеЗадачаОзнакомления Тогда
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(Предмет);
		Предметы.Добавить(ОписаниеПредмета);
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(ПредметыИнструкций.Задачи);
		Предметы.Добавить(ОписаниеПредмета);
		
		ЗаполнитьПредметыИнструкцийПоПредметамЗадачи(Предметы, ЭтаФорма.Объект.Предметы);
		
	Иначе
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(Предмет);
		Предметы.Добавить(ОписаниеПредмета);
		
	КонецЕсли;
	
КонецПроцедуры

// Дополняет структуру описания предмета по реквизитам документа
//
// Параметры:
//  ОписаниеПредмета - Структура
//  Документ         - Ссылка на внутренний / входящий / исходящий документ.
//
Процедура ЗаполнитьХарактеристикиПредметаПоРеквизитамДокумента(ОписаниеПредмета, Документ) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда
		ОписаниеПредмета.Вставить("Организация", Документ.Организация);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыВнутреннихДокументов")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьВидыВходящихДокументов")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьВидыИсходящихДокументов") Тогда
		ОписаниеПредмета.Вставить("ВидДокумента", Документ.ВидДокумента);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступа") Тогда
		ОписаниеПредмета.Вставить("ГрифДоступа", Документ.ГрифДоступа);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВопросыДеятельности") Тогда
		ОписаниеПредмета.Вставить("ВопросДеятельности", Документ.ВопросДеятельности);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов") Тогда
		Если Документ.Ссылка.Пустая() Тогда
			ОписаниеПредмета.Вставить("СостояниеДокумента", Перечисления.СостоянияДокументов.Проект);
		Иначе
			ОписаниеПредмета.Вставить("СостояниеДокумента", ПолучитьПоследнееСостояниеДокумента(Документ.Ссылка));
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеПредмета.Вставить("ШаблонДокумента", Документ.Шаблон);
	
КонецПроцедуры

// Дополняет структуру описания предмета по реквизитам документа
//
// Параметры:
//  ОписаниеПредмета - Структура
//  Документ         - Ссылка на внутренний / входящий / исходящий документ.
//  ЭтаФорма         -
//
Процедура ЗаполнитьХарактеристикиПредметаПоРеквизитамПроцесса(ОписаниеПредмета, Процесс, ЭтаФорма = Неопределено) Экспорт
	
	ОписаниеПредмета.Вставить("ШаблонПроцесса", Процесс.Шаблон);
	
КонецПроцедуры

// Возвращает последнее состояние документа. Если у документа больше одного состояния и
// последним состоянием является Проект, тогда возвращается состояние, установленное до него.
//
// Параметры:
//  Документ - СправочникСсылка.ВнутренниеДокументы
//             СправочникСсылка.ВходящиеДокументы
//             СправочникСсылка.ИсходящиеДокументы - 
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияДокументов
//
Функция ПолучитьПоследнееСостояниеДокумента(Документ)
	
	// Если для документа определено одно состояние, тогда возвращаем его.
	МассивСостояний = Делопроизводство.ПолучитьВсеСостоянияДокумента(Документ).ВыгрузитьКолонку("Состояние");
	Если МассивСостояний.Количество() = 0 Тогда
		Возврат Перечисления.СостоянияДокументов.ПустаяСсылка();
	ИначеЕсли МассивСостояний.Количество() = 1 Тогда 
		Возврат МассивСостояний[0]; 
	КонецЕсли;
	
	// Определяем последнее установленное состояние.
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияДокументов.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ИсторияСостоянийДокументов КАК СостоянияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеСостоянияДокументов КАК ТекущиеСостоянияДокументов
		|		ПО СостоянияДокументов.Состояние = ТекущиеСостоянияДокументов.Состояние
		|			И СостоянияДокументов.Документ = ТекущиеСостоянияДокументов.Документ
		|ГДЕ
		|	СостоянияДокументов.Документ = &Документ
		|	И СостоянияДокументов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проект)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостоянияДокументов.Период УБЫВ";
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Состояние; 
	
КонецФункции

// Дополняет массив предметов инструкций предметами процесса
//
// Параметры:
//  Предметы         - Массив - Массив описаний предметов инструкций
//  ПредметыПроцесса - Табличная часть объекта задачи
//
Процедура ЗаполнитьПредметыИнструкцийПоПредметамЗадачи(Предметы, ПредметыЗадачи) Экспорт
	
	ПредметыДляОбработки = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ПредметыЗадачи Цикл
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Предмет) Тогда
			Продолжить;
		КонецЕсли;
		
		ПредметыДляОбработки.Добавить(ТекСтрока.Предмет);
	КонецЦикла;
	
	Если Не ПользователиСерверПовтИсп.ЭтоПолноправныйПользовательИБ() Тогда
		ПользователиДляПроверкиПрав = Новый Массив;
		ПользователиДляПроверкиПрав.Добавить(ПользователиКлиентСервер.ТекущийПользователь());
		ПраваНаПредметы = ДокументооборотПраваДоступа.ПолучитьПраваПользователейПоОбъектам(
			ПредметыДляОбработки, Истина, ПользователиДляПроверкиПрав);
		ПредметыДляОбработки = ПраваНаПредметы.ВыгрузитьКолонку("ОбъектДоступа");
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ ПредметыДляОбработки Цикл
		Если ТипЗнч(ТекСтрока) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
			
			ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(
				Справочники.ПредметыИнструкций.ВнутренниеДокументы);
			ЗаполнитьХарактеристикиПредметаПоРеквизитамДокумента(ОписаниеПредмета, ТекСтрока);
			Предметы.Добавить(ОписаниеПредмета);
			
		ИначеЕсли ТипЗнч(ТекСтрока) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
			
			ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(
				Справочники.ПредметыИнструкций.ВходящиеДокументы);
			ЗаполнитьХарактеристикиПредметаПоРеквизитамДокумента(ОписаниеПредмета, ТекСтрока);
			Предметы.Добавить(ОписаниеПредмета);
			
		ИначеЕсли ТипЗнч(ТекСтрока) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
			
			ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(
				Справочники.ПредметыИнструкций.ИсходящиеДокументы);
			ЗаполнитьХарактеристикиПредметаПоРеквизитамДокумента(ОписаниеПредмета, ТекСтрока);
			Предметы.Добавить(ОписаниеПредмета);
			
		КонецЕсли;
    КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
